РП/src/Catalogs/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыБюджетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.МоделиБюджетирования</owners>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляВводаПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПланирования</name>
    <type>
      <types>EnumRef.СпособыСоставленияБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасположенияГраницыФактическихДанных</name>
    <type>
      <types>EnumRef.ВариантыРасположенияГраницыФактическиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовСкользящегоБюджета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеГраницыФакта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьГраницыФакта</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АналитикиШапки</name>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/InformationRegisters/СтатусыОбработкиВидаБюджета/СтатусыОбработкиВидаБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбработкиВидаБюджета</name>
  <resources>
    <name>ПроверенУспешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСтруктурыКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСтруктурыКолонок</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСтруктурыОписанияВидаБюджетаДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСтруктурыОписанияВидаБюджетаДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСтруктурыОписанияВидаБюджетаОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСтруктурыОписанияВидаБюджетаОтчет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСтруктурыОписанияВидаБюджетаЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСтруктурыОписанияВидаБюджетаЗаполнение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшДереваЭлементовБезДопЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаДереваЭлементовБезДопЭлементов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшДереваЭлементовСДопЭлементами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаДереваЭлементовСДопЭлементами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСхемыКомпоновкиДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСхемыКомпоновкиДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСхемыКомпоновкиОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСхемыКомпоновкиОтчет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшСхемыКомпоновкиЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаСхемыКомпоновкиЗаполнение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшДереваВывода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаДереваВывода</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СформированКэшПараметровСпискаВвода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеКэшаПараметровСпискаВвода</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетГраницуФактическихДанных</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>CatalogRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СпособыСоставленияБюджетов/СпособыСоставленияБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСоставленияБюджетов</name>
  <enumValues>
    <name>НаФиксированныйПериод</name>
  </enumValues>
  <enumValues>
    <name>Скользящий</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ВариантыРасположенияГраницыФактическиДанных/ВариантыРасположенияГраницыФактическиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасположенияГраницыФактическиДанных</name>
  <enumValues>
    <name>ДоНачалаСоставленияБюджета</name>
  </enumValues>
  <enumValues>
    <name>ВнутриПериодаБюджета</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ВидыБюджетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.СтатусыОбработкиВидаБюджета.СоздатьНаборЗаписей();
	Набор.Отбор.ВидБюджета.Установить(Ссылка);
	Набор.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Перем Значение;
	
	Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "Владелец") Тогда
		Владелец = Справочники.МоделиБюджетирования.МодельБюджетированияПоУмолчанию();
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "Периодичность") Тогда
			Периодичность = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "СпособПланирования") Тогда
			СпособПланирования = Перечисления.СпособыСоставленияБюджетов.НаФиксированныйПериод;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "ВариантРасположенияГраницыФактическихДанных") Тогда
			ВариантРасположенияГраницыФактическихДанных = Перечисления.ВариантыРасположенияГраницыФактическиДанных.ВнутриПериодаБюджета;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "КоличествоПериодовСкользящегоБюджета") Тогда
			КоличествоПериодовСкользящегоБюджета = 1;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "СмещениеГраницыФакта") Тогда
			СмещениеГраницыФакта = 1;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "ПериодичностьГраницыФакта") Тогда
			ПериодичностьГраницыФакта = Перечисления.Периодичность.Месяц;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, ИмяРеквизита)
	Перем Значение;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство(ИмяРеквизита, Значение)
		ИЛИ Значение = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
